data/old-data/ycsbf/a-run-16384-32-8-2024-01-12-00-44-with-append.out
Nameless WALs: Opening character device: /dev/ng1n1
MDTS 524288 
Zasl is 4194304 4096 
Register channel 0
Register channel 1
Register channel 2
Register channel 3
Register channel 4
Register channel 5
Register channel 6
Register channel 7
Nameless WALs: Opened character device
Booting from modified ZenFS
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
[...]
WAL allocated for zones 4 to 7 
Register channel 8
WAL size 17169416192 
Last write (recover) 4: 15470592 4195032 
Last write (close) 4: 15470592 0 
Delete once log 
Unegister channel 9
WAL allocated for zones 7 to 10 
Register channel 8
WAL size 17169448960 
Last write (recover) 7: 15466496 4191966 
Last write (close) 7: 15466496 0 
Delete once log 
Unegister channel 9
Last write (recover) 3735928559: 11274530 0 
Last write (recover) 3735928559: 11275560 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
[...]
WAL allocated for zones 10 to 13 
Register channel 8
WAL size 9075294208 
Last write (recover) 10: 15474688 4194298 
Last write (close) 10: 15474688 0 
Delete once log 
Unegister channel 9
WAL allocated for zones 4 to 7 
Register channel 8
WAL size 17169416192 
Last write (recover) 4: 15470592 4195159 
Last write (close) 4: 15470592 0 
Delete once log 
Unegister channel 9
Last write (recover) 3735928559: 11275433 0 
Last write (recover) 3735928559: 11280390 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
[...]
WAL allocated for zones 7 to 10 
Register channel 8
WAL size 17169448960 
Last write (recover) 7: 15450112 4193777 
Last write (close) 7: 15450112 0 
Delete once log 
Unegister channel 9
WAL allocated for zones 4 to 7 
Register channel 8
WAL size 17169416192 
Last write (recover) 4: 15478784 4195103 
Last write (close) 4: 15478784 0 
Delete once log 
Unegister channel 9
Last write (recover) 3735928559: 11283681 0 
Last write (recover) 3735928559: 11256335 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
[...]
WAL allocated for zones 10 to 13 
Register channel 8
WAL size 9075294208 
Last write (recover) 10: 15474688 4192152 
Last write (close) 10: 15474688 0 
Delete once log 
Unegister channel 9
WAL allocated for zones 4 to 7 
Register channel 8
WAL size 17169416192 
Last write (recover) 4: 15462400 4191747 
Last write (close) 4: 15462400 0 
Delete once log 
Unegister channel 9
Last write (recover) 3735928559: 11270653 0 
Last write (recover) 3735928559: 11282536 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
[...]
WAL allocated for zones 7 to 10 
Register channel 8
WAL size 17169448960 
Last write (recover) 7: 15482880 4193003 
Last write (close) 7: 15482880 0 
Delete once log 
Unegister channel 9
WAL allocated for zones 4 to 7 
Register channel 8
WAL size 17169416192 
Last write (recover) 4: 15470592 4193609 
Last write (close) 4: 15470592 0 
Delete once log 
Unegister channel 9
Last write (recover) 3735928559: 11276983 0 
Last write (recover) 3735928559: 11289877 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
[...]
WAL allocated for zones 10 to 13 
Register channel 8
WAL size 9075294208 
Last write (recover) 10: 15470592 4195060 
Last write (close) 10: 15470592 0 
Delete once log 
Unegister channel 9
WAL allocated for zones 4 to 7 
Register channel 8
WAL size 17169416192 
Last write (recover) 4: 15470592 4195224 
Last write (close) 4: 15470592 0 
Delete once log 
Unegister channel 9
Last write (recover) 3735928559: 11275368 0 
Last write (recover) 3735928559: 11275532 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
[...]
WAL allocated for zones 7 to 10 
Register channel 8
WAL size 17169448960 
Last write (recover) 7: 15474688 4192275 
Last write (close) 7: 15474688 0 
Delete once log 
Unegister channel 9
WAL allocated for zones 4 to 7 
Register channel 8
WAL size 17169416192 
Last write (recover) 4: 15470592 4192777 
Last write (close) 4: 15470592 0 
Delete once log 
Unegister channel 9
WAL allocated for zones 10 to 13 
Register channel 8
WAL size 9075294208 
Last write (recover) 10: 10338304 2218641 
Last write (close) 10: 10338304 0 
Delete once log 
Unegister channel 9
WAL allocated for zones 7 to 10 
Register channel 8
Extent could not be found?
WAL allocated for zones 4 to 7 
Register channel 9
Extent could not be found?
WAL allocated for zones 10 to 13 
Register channel 10
[OVERALL], RunTime(ms), 323469
[OVERALL], Throughput(ops/sec), 3091.486355724969
[TOTAL_GCS_G1_Young_Generation], Count, 7
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 49
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.015148283143052348
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 7
[TOTAL_GC_TIME], Time(ms), 49
[TOTAL_GC_TIME_%], Time(%), 0.015148283143052348
[READ], Operations, 500539
[READ], AverageLatency(us), 246.5386513338621
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 9023
[READ], 95thPercentileLatency(us), 1097
[READ], 99thPercentileLatency(us), 2489
[READ], Return=OK, 500539
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 782592.0
[CLEANUP], MinLatency(us), 782336
[CLEANUP], MaxLatency(us), 782847
[CLEANUP], 95thPercentileLatency(us), 782847
[CLEANUP], 99thPercentileLatency(us), 782847
[UPDATE], Operations, 499461
[UPDATE], AverageLatency(us), 268.6034585282935
[UPDATE], MinLatency(us), 9
[UPDATE], MaxLatency(us), 16543
[UPDATE], 95thPercentileLatency(us), 1121
[UPDATE], 99thPercentileLatency(us), 2521
[UPDATE], Return=OK, 499461