data/old-data/ycsbf/b-run-16384-32-8-2024-01-12-00-57-with-append.out
Nameless WALs: Opening character device: /dev/ng1n1
MDTS 524288 
Zasl is 4194304 4096 
Register channel 0
Register channel 1
Register channel 2
Register channel 3
Register channel 4
Register channel 5
Register channel 6
Register channel 7
Nameless WALs: Opened character device
Booting from modified ZenFS
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
[...]
WAL allocated for zones 4 to 7 
Register channel 8
WAL size 17169383424 
Last write (recover) 4: 15466496 4193309 
Last write (close) 4: 15466496 0 
Delete once log 
Unegister channel 9
WAL allocated for zones 7 to 10 
Register channel 8
WAL size 17169416192 
Last write (recover) 7: 15478784 4193707 
Last write (close) 7: 15478784 0 
Delete once log 
Unegister channel 9
Last write (recover) 3735928559: 11285077 0 
Last write (recover) 3735928559: 11273187 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
[...]
WAL allocated for zones 10 to 13 
Register channel 8
WAL size 9075261440 
Last write (recover) 10: 15470592 4194912 
Last write (close) 10: 15470592 0 
Delete once log 
Unegister channel 9
WAL allocated for zones 4 to 7 
Register channel 8
WAL size 17169383424 
Last write (recover) 4: 15470592 4193936 
Last write (close) 4: 15470592 0 
Delete once log 
Unegister channel 9
Last write (recover) 3735928559: 11276656 0 
Last write (recover) 3735928559: 11275680 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
[...]
WAL allocated for zones 7 to 10 
Register channel 8
WAL size 17169416192 
Last write (recover) 7: 15478784 4194075 
Last write (close) 7: 15478784 0 
Delete once log 
Unegister channel 9
WAL allocated for zones 4 to 7 
Register channel 8
WAL size 17169383424 
Last write (recover) 4: 15474688 4195658 
Last write (close) 4: 15474688 0 
Delete once log 
Unegister channel 9
Last write (recover) 3735928559: 11279030 0 
Last write (recover) 3735928559: 11284709 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
[...]
WAL allocated for zones 10 to 13 
Register channel 8
WAL size 9075261440 
Last write (recover) 10: 15478784 4195157 
Last write (close) 10: 15478784 0 
Delete once log 
Unegister channel 9
WAL allocated for zones 4 to 7 
Register channel 8
WAL size 17169383424 
Last write (recover) 4: 15470592 4192747 
Last write (close) 4: 15470592 0 
Delete once log 
Unegister channel 9
Last write (recover) 3735928559: 11277845 0 
Last write (recover) 3735928559: 11283627 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
[...]
WAL allocated for zones 7 to 10 
Register channel 8
WAL size 17169416192 
Last write (recover) 7: 15462400 4193903 
Last write (close) 7: 15462400 0 
Delete once log 
Unegister channel 9
WAL allocated for zones 4 to 7 
Register channel 8
WAL size 17169383424 
Last write (recover) 4: 15474688 4195421 
Last write (close) 4: 15474688 0 
Delete once log 
Unegister channel 9
Last write (recover) 3735928559: 11279267 0 
Last write (recover) 3735928559: 11268497 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
[...]
WAL allocated for zones 10 to 13 
Register channel 8
WAL size 9075261440 
Last write (recover) 10: 15466496 4193330 
Last write (close) 10: 15466496 0 
Delete once log 
Unegister channel 9
WAL allocated for zones 4 to 7 
Register channel 8
WAL size 17169383424 
Last write (recover) 4: 15466496 4192238 
Last write (close) 4: 15466496 0 
Delete once log 
Unegister channel 9
Last write (recover) 3735928559: 11274258 0 
Last write (recover) 3735928559: 11273166 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
Last write (recover) 3735928559: 0 0 
[...]
WAL allocated for zones 7 to 10 
Register channel 8
WAL size 17169416192 
Last write (recover) 7: 15470592 4195252 
Last write (close) 7: 15470592 0 
Delete once log 
Unegister channel 9
WAL allocated for zones 4 to 7 
Register channel 8
WAL size 17169383424 
Last write (recover) 4: 15466496 4194630 
Last write (close) 4: 15466496 0 
Delete once log 
Unegister channel 9
WAL allocated for zones 10 to 13 
Register channel 8
WAL size 9075261440 
Last write (recover) 10: 10334208 2215667 
Last write (close) 10: 10334208 0 
Delete once log 
Unegister channel 9
WAL allocated for zones 7 to 10 
Register channel 8
Extent could not be found?
WAL allocated for zones 4 to 7 
Register channel 9
Extent could not be found?
WAL allocated for zones 10 to 13 
Register channel 10
[OVERALL], RunTime(ms), 311481
[OVERALL], Throughput(ops/sec), 3210.4686963249765
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 32
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.010273499828239925
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 32
[TOTAL_GC_TIME_%], Time(%), 0.010273499828239925
[READ], Operations, 950030
[READ], AverageLatency(us), 241.72184667852594
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 12719
[READ], 95thPercentileLatency(us), 988
[READ], 99thPercentileLatency(us), 2413
[READ], Return=OK, 950030
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 31448.0
[CLEANUP], MinLatency(us), 31440
[CLEANUP], MaxLatency(us), 31455
[CLEANUP], 95thPercentileLatency(us), 31455
[CLEANUP], 99thPercentileLatency(us), 31455
[UPDATE], Operations, 49970
[UPDATE], AverageLatency(us), 274.6718831298779
[UPDATE], MinLatency(us), 11
[UPDATE], MaxLatency(us), 5183
[UPDATE], 95thPercentileLatency(us), 1029
[UPDATE], 99thPercentileLatency(us), 2465
[UPDATE], Return=OK, 49970